app/controllers/films_controller.rb

SELECT "films".* FROM "films"
---
  def index
    @films = Film.all

INSERT INTO "films" ("movie", "length", "review", "director", "rating", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @film = current_user.films.build(film_params)

    respond_to do |format|
      if @film.save

UPDATE "films" SET "length" = ?, "review" = ?, "director" = ?, "rating" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["length", " 1:30"], ["review", "  good dof fdsifd fidsnf df fnfewnf 9unfew"], ["director", " fdfjfdjsf"], ["rating", "  fd"], ["updated_at", "2017-03-20 01:18:43.114327"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @film.update(film_params)

DELETE FROM "films" WHERE "films"."id" = ?  [["id", 1]]
---
  def destroy
    @film.destroy

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_film
      @film = Film.find(params[:id])